; domain
;; changed from IPC2023 learning version to 2013 version in order for powerlifted parser to work
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/childsnack/domain.pddl
;; updates:
;;   - :equality removed
;;   - :negative-preconditions added
;;   - action move_tray has a new precondition: (not (at ?t ?p2))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; The child-snack domain 2013
;;
;; This domain is for planning how to make and serve sandwiches for a group of
;; children in which some are allergic to gluten. There are two actions for
;; making sandwiches from their ingredients. The first one makes a sandwich and
;; the second one makes a sandwich taking into account that all ingredients are
;; gluten-free. There are also actions to put a sandwich on a tray, to move a tray
;; from one place to another and to serve sandwiches.
;;
;; Problems in this domain define the ingredients to make sandwiches at the initial
;; state. Goals consist of having all kids served with a sandwich to which they
;; are not allergic.
;;
;; Author: Raquel Fuentetaja and Tomás de la Rosa
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(define (domain childsnack)
(:requirements :typing :equality)
(:types child bread-portion content-portion sandwich tray place)
(:constants kitchen - place)

(:predicates (at_kitchen_bread ?b - bread-portion)
	     (at_kitchen_content ?c - content-portion)
     	     (at_kitchen_sandwich ?s - sandwich)
     	     (no_gluten_bread ?b - bread-portion)
       	     (no_gluten_content ?c - content-portion)
      	     (ontray ?s - sandwich ?t - tray)
       	     (no_gluten_sandwich ?s - sandwich)
	     (allergic_gluten ?c - child)
     	     (not_allergic_gluten ?c - child)
	     (served ?c - child)
	     (waiting ?c - child ?p - place)
             (at ?t - tray ?p - place)
	     (notexist ?s - sandwich)
  )

(:action make_sandwich_no_gluten
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and (at_kitchen_bread ?b)
			    (at_kitchen_content ?c)
			    (no_gluten_bread ?b)
			    (no_gluten_content ?c)
			    (notexist ?s))
	 :effect (and
		   (not (at_kitchen_bread ?b))
		   (not (at_kitchen_content ?c))
		   (at_kitchen_sandwich ?s)
		   (no_gluten_sandwich ?s)
                   (not (notexist ?s))
		   ))


(:action make_sandwich
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and (at_kitchen_bread ?b)
			    (at_kitchen_content ?c)
                            (notexist ?s)
			    )
	 :effect (and
		   (not (at_kitchen_bread ?b))
		   (not (at_kitchen_content ?c))
		   (at_kitchen_sandwich ?s)
                   (not (notexist ?s))
		   ))


(:action put_on_tray
	 :parameters (?s - sandwich ?t - tray)
	 :precondition (and  (at_kitchen_sandwich ?s)
			     (at ?t kitchen))
	 :effect (and
		   (not (at_kitchen_sandwich ?s))
		   (ontray ?s ?t)))


(:action serve_sandwich_no_gluten
 	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and
		       (allergic_gluten ?c)
		       (ontray ?s ?t)
		       (waiting ?c ?p)
		       (no_gluten_sandwich ?s)
                       (at ?t ?p)
		       )
	:effect (and (not (ontray ?s ?t))
		     (served ?c)))

(:action serve_sandwich
	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and (not_allergic_gluten ?c)
	                   (waiting ?c ?p)
			   (ontray ?s ?t)
			   (at ?t ?p))
	:effect (and (not (ontray ?s ?t))
		     (served ?c)))

(:action move_tray
	 :parameters (?t - tray ?p1 ?p2 - place)
	 :precondition (and (at ?t ?p1))
	 :effect (and (not (at ?t ?p1))
		      (at ?t ?p2)))


)

; problem
;; children=7, allergic_children=3, trays=2, sandwiches=10, out_folder=training/easy, instance_id=60, seed=88

(define (problem childsnack-60)
 (:domain childsnack)
 (:objects 
    child1 child2 child3 child4 child5 child6 child7 - child
    tray1 tray2 - tray
    sandw1 sandw2 sandw3 sandw4 sandw5 sandw6 sandw7 sandw8 sandw9 sandw10 - sandwich
    bread1 bread2 bread3 bread4 bread5 bread6 bread7 - bread-portion
    content1 content2 content3 content4 content5 content6 content7 - content-portion
    table1 table2 table3 - place
    )
 (:init 
    (at tray1 kitchen)
    (at tray2 kitchen)
    (at_kitchen_bread bread1)
    (at_kitchen_bread bread2)
    (at_kitchen_bread bread3)
    (at_kitchen_bread bread4)
    (at_kitchen_bread bread5)
    (at_kitchen_bread bread6)
    (at_kitchen_bread bread7)
    (at_kitchen_content content1)
    (at_kitchen_content content2)
    (at_kitchen_content content3)
    (at_kitchen_content content4)
    (at_kitchen_content content5)
    (at_kitchen_content content6)
    (at_kitchen_content content7)
    (allergic_gluten child7)
    (allergic_gluten child1)
    (allergic_gluten child5)
    (not_allergic_gluten child6)
    (not_allergic_gluten child3)
    (not_allergic_gluten child2)
    (not_allergic_gluten child4)
    (no_gluten_bread bread7)
    (no_gluten_bread bread2)
    (no_gluten_bread bread4)
    (no_gluten_content content4)
    (no_gluten_content content5)
    (no_gluten_content content3)
    (waiting child7 table2)
    (waiting child1 table2)
    (waiting child5 table2)
    (waiting child6 table3)
    (waiting child3 table2)
    (waiting child2 table1)
    (waiting child4 table2)
    (notexist sandw1)
    (notexist sandw2)
    (notexist sandw3)
    (notexist sandw4)
    (notexist sandw5)
    (notexist sandw6)
    (notexist sandw7)
    (notexist sandw8)
    (notexist sandw9)
    (notexist sandw10))
 (:goal  (and (served child1)
   (served child2)
   (served child3)
   (served child4)
   (served child5)
   (served child6)
   (served child7))))

; plan
1. (make_sandwich_no_gluten sandw1 bread7 content4)
   deleted: (at_kitchen_bread bread7) (at_kitchen_content content4) (notexist sandw1)
   added: (at_kitchen_sandwich sandw1) (no_gluten_sandwich sandw1)
   goals met: 0 of 7
2. (make_sandwich_no_gluten sandw2 bread2 content5)
   deleted: (at_kitchen_bread bread2) (at_kitchen_content content5) (notexist sandw2)
   added: (at_kitchen_sandwich sandw2) (no_gluten_sandwich sandw2)
   goals met: 0 of 7
3. (make_sandwich_no_gluten sandw3 bread4 content3)
   deleted: (at_kitchen_bread bread4) (at_kitchen_content content3) (notexist sandw3)
   added: (at_kitchen_sandwich sandw3) (no_gluten_sandwich sandw3)
   goals met: 0 of 7
4. (make_sandwich sandw4 bread1 content1)
   deleted: (at_kitchen_bread bread1) (at_kitchen_content content1) (notexist sandw4)
   added: (at_kitchen_sandwich sandw4)
   goals met: 0 of 7
5. (make_sandwich sandw5 bread3 content2)
   deleted: (at_kitchen_bread bread3) (at_kitchen_content content2) (notexist sandw5)
   added: (at_kitchen_sandwich sandw5)
   goals met: 0 of 7
6. (make_sandwich sandw6 bread5 content6)
   deleted: (at_kitchen_bread bread5) (at_kitchen_content content6) (notexist sandw6)
   added: (at_kitchen_sandwich sandw6)
   goals met: 0 of 7
7. (make_sandwich sandw7 bread6 content7)
   deleted: (at_kitchen_bread bread6) (at_kitchen_content content7) (notexist sandw7)
   added: (at_kitchen_sandwich sandw7)
   goals met: 0 of 7
8. (put_on_tray sandw1 tray1)
   deleted: (at_kitchen_sandwich sandw1)
   added: (ontray sandw1 tray1)
   goals met: 0 of 7
9. (put_on_tray sandw2 tray1)
   deleted: (at_kitchen_sandwich sandw2)
   added: (ontray sandw2 tray1)
   goals met: 0 of 7
10. (put_on_tray sandw3 tray1)
   deleted: (at_kitchen_sandwich sandw3)
   added: (ontray sandw3 tray1)
   goals met: 0 of 7
11. (put_on_tray sandw4 tray1)
   deleted: (at_kitchen_sandwich sandw4)
   added: (ontray sandw4 tray1)
   goals met: 0 of 7
12. (put_on_tray sandw5 tray1)
   deleted: (at_kitchen_sandwich sandw5)
   added: (ontray sandw5 tray1)
   goals met: 0 of 7
13. (put_on_tray sandw6 tray1)
   deleted: (at_kitchen_sandwich sandw6)
   added: (ontray sandw6 tray1)
   goals met: 0 of 7
14. (put_on_tray sandw7 tray1)
   deleted: (at_kitchen_sandwich sandw7)
   added: (ontray sandw7 tray1)
   goals met: 0 of 7
15. (move_tray tray1 kitchen table1)
   deleted: (at tray1 kitchen)
   added: (at tray1 table1)
   goals met: 0 of 7
16. (serve_sandwich sandw4 child2 tray1 table1)
   deleted: (ontray sandw4 tray1)
   added: (served child2)
   goals met: 1 of 7
17. (move_tray tray1 table1 table2)
   deleted: (at tray1 table1)
   added: (at tray1 table2)
   goals met: 1 of 7
18. (serve_sandwich_no_gluten sandw1 child1 tray1 table2)
   deleted: (ontray sandw1 tray1)
   added: (served child1)
   goals met: 2 of 7
19. (serve_sandwich sandw5 child3 tray1 table2)
   deleted: (ontray sandw5 tray1)
   added: (served child3)
   goals met: 3 of 7
20. (serve_sandwich sandw6 child4 tray1 table2)
   deleted: (ontray sandw6 tray1)
   added: (served child4)
   goals met: 4 of 7
21. (serve_sandwich_no_gluten sandw2 child5 tray1 table2)
   deleted: (ontray sandw2 tray1)
   added: (served child5)
   goals met: 5 of 7
22. (serve_sandwich_no_gluten sandw3 child7 tray1 table2)
   deleted: (ontray sandw3 tray1)
   added: (served child7)
   goals met: 6 of 7
23. (move_tray tray1 table2 table3)
   deleted: (at tray1 table2)
   added: (at tray1 table3)
   goals met: 6 of 7
24. (serve_sandwich sandw7 child6 tray1 table3)
   deleted: (ontray sandw7 tray1)
   added: (served child6)
   goals met: 7 of 7
